<?php 

// 匹配诗词


$str= "任他打骂亲生女，暗地心疼不敢诃。

第三等，乃朝趁暮食肩担之家，此等人家儿女，纵是生母在时，只好苟免饥寒，料道没甚丰衣足食。巴到十来岁，也就要指望教去学做生意，趁三文五文帮贴柴火。若又遇着个凶恶继母，岂不是苦上加苦。口中吃了，定然有一顿没一顿，担饥忍饿。就要口热汤，也须请问个主意，不敢擅专。身上穿的，不是前拖一块，定是后破一片。受冻捱寒，也不敢在他面前说个冷字。那几根头发，整年也难得与梳子相会，胡乱挽个角儿，还不是挦得披头盖脸。两只脚久常赤着，从不曾见鞋袜面。若得了双草鞋，就胜如穿着粉底皂靴。专任的是劈柴烧火，担水提浆。稍不如意，软的是拳头脚尖，硬的是木柴棍棒。那咒骂乃口头言语，只当与他消闲。到得将就挑得担子，便限着每日要赚若干钱钞。若还缺了一文，少不得敲个半死。倘肯撺掇老公，卖与人家为奴，这就算他一点阴骘。所以小户人家儿女，经着后母，十个到有九个磨折死了。有诗为证：

小家儿女受艰辛，后母加添妄怒嗔。

打骂饥寒浑不免，人前一样唤娘亲。

说话的，为何只管絮絮叨叨，道后母的许多短处？只因在下今日要说一个继母谋害前妻儿女，后来天理昭彰，反受了国法，与天下的后母做个榜样，故先略道其概。这段话文若说出来时：

直教铁汉也心酸，总是石人亦泪洒！

你道这段话文，出在那里？就在本朝正德年间，北京顺天府旗手卫，有个荫籍百户李雄。他虽是武弁出身，却从幼聪明好学，深知典籍。及至年长，身材魁伟，膂力过人；使得好刀，躲得好箭，是一个文武兼备的将官。因随太监张永征陕西安化王有功，升锦衣卫千户。娶得个夫人何氏，夫妻十分恩爱。生下三女一男：儿子名曰承祖，长女名玉英，次女名桃英，三女名月英。元来是先花后果的。倒是玉英居长，次即承祖。不想何氏自产月英之后，便染了个虚怯症候，不上半年，呜呼哀哉！可怜：

留得旧时残锦绣，每因肠断动悲伤！

那时玉英刚刚六岁，承祖五岁，桃英三岁，月英止有五六个月。虽有养娘、奶子伏侍，到底像小鸡失了鸡母，七慌八乱，啼啼哭哭。李雄见儿女这般苦楚，心下烦恼，只得终日住在家中窝伴。他本是个";

