<?php

$handle = fopen("./1.txt", "r");

$style=<<<EOF
<script type="text/javascript">
    var head = document.getElementsByTagName('head')[0];
    cssURL = '/public/article_1.css';
    linkTag = document.createElement('link');
    linkTag.href = cssURL;
    linkTag.setAttribute('type','text/css');
    linkTag.setAttribute('rel','stylesheet');
    head.appendChild(linkTag);
</script>

EOF;

$toc = ['钟孝廉','酆都知县','狐生员劝人修仙','煞神受枷','蒲州盐枭','地穷宫','刘刺史奇梦','雷公被绐','两神相殴','白虹精','千年仙鹤','仙鹤扛车','狐祖师','雷部三爷','偷雷锥','土地受饿','秃尾龙','九天玄女','地藏王接客','狮子大王','张大帝','羞疾','妓仙','李百年','雷祖','燧人钻火树','兔儿神','山阴风灾','子不语娘娘','指上栖龙','仙童行雨','番僧化鹤','南山顽石','赵大将军刺皮脸怪','蝴蝶怪','不倒翁','罗刹鸟','鄱阳湖黑鱼精','囊囊','秦毛人','人同','赑屃精','缚山魈','老妪变狼','吴生不归','蜈蚣吐丹','石言','人熊','驱鲎','铁匣壁虎','蛇王','城门面孔','匾怪','美人鱼人面猪','花魄','狼军师','物变','四耳猫','鹏粪','獭淫','多角兽','骷髅报仇','骷髅吹气','胡求为鬼球','鬼着衣受网','平阳令','马盼盼','妖道乞鱼','水仙殿','赌钱神号迷龙','城隍杀鬼不许为聻','陈清恪公吹气退鬼','符离楚客','洗紫河车','空心鬼','画工画僵尸','羊践前缘','义犬附魂','钉鬼脱逃','鬼乖乖','冒失鬼','医肺痈用白术','一目五先生','治鬼二妙','官癖','奇鬼眼生背上','两僵尸野合','狐仙自缢','淘气','白骨精','娄真人错捉妖','旱魃','丁大哥','鬼市','犼','旱魃有三种','银伥','文人夜有光','虎伥','掠剩鬼','魍魉','大乐上人','叶老脱','三头人','摸龙阿太','道士取葫芦','鬼有三技过此鬼道乃穷','三斗汉','人虾','鸭嬖','葛道人以风洗手','纣之值殿将军','董金瓯','姚剑仙','裹足作俑之报','吕道人驱龙','盘古以前天','禹王碑吞蛇','飞僵','江秀才寄话','大胞人','卖蒜叟','借棺为车','姚端恪公遇剑仙','佟觭角','伊五','清凉老人','徐崖客','鸡脚人','猢狲酒','娄罗二道人','水精孝廉','石揆谛晖','翻洗酒坛','浮海','邢天国','浮提国','韩铁棍','李通判','滇绵谷秀才半世女妆','炼丹道士','陈圣涛遇狐','猎户除狐','藏魂坛','老妪为妖','猪道人即郑鄤','高相国种须','张奇神','道士作祟自毙','鞭尸','绳拉云','烧狼筋','陆夫人','蛊','奇术','卖冬瓜人','仙人顶门无发','广西鬼师','采战之报','虾蟆蛊','返魂香','禁魇婆','虾蟆教书蚁排阵','讨亡术','狗熊写字','人化鼠行窃','唱歌犬','铁牛法','妖术二则','种蟹','张元妻','关东毛人以人为饵','天壳','雷诛营卒','旁观因果','常熟程生','大毛人攫女','九夫坟','凤凰山崩','妖梦三则','龙阵风','误尝粪','拘忌','白莲教','红毛国人吐妓','大力河','女化男','黑苗洞','人畜改常','奇骗','产公','黑霜','铜人演西厢','双花庙','风流具','偷靴','伏波滩义犬','沙弥思老虎','禅师吞蛋','狐仙惧内','多官','夜航船二则','京中新婚','蝎虎遗精','溺壶失节'];

if ($handle) {
    $i = 0;
    $j = 0;
    $dir = '';
    // $name = str_pad($i, 3, "0", STR_PAD_LEFT);
    // $handle1 = fopen("./doc/".$name.".md","a");
    $flag = '';
    $handle1 = fopen("./001", "a");
    while (($buffer = fgets($handle, 4096)) !== false) {
        // if($buffer == ''){
        //     continue;
        // }
        if (preg_match("/##/", $buffer)) { // 找目录名
            $arr = explode(' ', $buffer);
            $ss = trim($arr[1]) . trim($arr[2]);
            
            $i = 1;
            $j++;
            
            $dname = str_pad($j, 2, "0", STR_PAD_LEFT);
            $dir = "./" . $dname . $ss;
            echo $dir;
            if (!is_dir($dir)) {
                mkdir($dir);
            }
        } else if(in_array(trim($buffer), $toc)){ // 文件名
            $name = str_pad($i, 2, "0", STR_PAD_LEFT);
            $names = trim($buffer);
            // touch($dir . "/" . $name . $names . ".md");
            $handle1 = fopen( $dir . "/" . $name . $names . ".md", "a");
            $i++;

            fwrite($handle1, $style);
            fwrite($handle1, "### " . $buffer);
        }else{
            fwrite($handle1, $buffer);
        }
    }

    fclose($handle);
}